#- 1
students = 22
# int потому что количество студентов - целое число

# - 2
temperature = 11.5
# float потому что температура может быть дробной

# - 3
login = "ivanov_ivan"
# str потому что логин хранится как текст

# - 4
notifications = True
# bool потому что здесь только два значения: да или нет

# - 5
films = ["Матрица", "Аватар", "Интерстеллар"]
# list потому что можно хранить несколько значений

# - 6
point = (10, 20)
# tuple потому что координаты не должны изменяться

# - 7
product_ids = {123, 124, 125}
# set потому что значения не должны повторяться

# - 8
countries = {
    "Россия": "Москва",
    "Франция": "Париж"
}
# dict потому что данные хранятся в формате ключа значение