# - контрольные вопросы

# - 1. что выполнится первым в выражении 5 + 3 * 2?
# сначала выполнится умножение 3 * 2, потому что умножение имеет больший приоритет
# потом к результату прибавится 5
# ответ: 11


# - 2. чему равно 10 % 3?
# оператор % показывает остаток от деления
# 10 делится на 3 три раза и остается 1
# ответ: 1


# - 3. что возвращает выражение True and False?
# выражение вернет False
# потому что оператор and возвращает True только когда оба значения True


# - 4. какая функция вычисляет квадратный корень?
# квадратный корень можно вычислить с помощью math.sqrt()
# например: math.sqrt(25) вернет 5


# - 5. где в реальной жизни используются операции и выражения, которые мы изучили?
# например, при расчете времени, расстояния, денег, сдачи и количества предметов
# также их можно использовать в программах для разных математических расчетов